source/6_Lesson.org
#+STARTUP:indent
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/styles.css"/>
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
#+HTML_HEAD_EXTRA: <script src="http://ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.js" type="text/javascript"></script>
#+HTML_HEAD_EXTRA: <script src="js/navbar.js" type="text/javascript"></script>
#+OPTIONS: f:nil author:nil num:nil creator:nil timestamp:nil toc:nil html-style:nil

#+TITLE: The End is Nigh...
#+AUTHOR: Paul Dougall

#+BEGIN_HTML
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/9-CS-gameTheory">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li> 
      <li><a href="5_Lesson.html">Week5</a></li> 
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="assessment.html">Assessment</a></li>
    </ul>
  </div>
#+END_HTML
* COMMENT Use as a template
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:

** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:

** Design It
:PROPERTIES:
:HTML_CONTAINER_CLASS: design
:END:

** Build It
:PROPERTIES:
:HTML_CONTAINER_CLASS: build
:END:

** Test It
:PROPERTIES:
:HTML_CONTAINER_CLASS: test
:END:

** Run It
:PROPERTIES:
:HTML_CONTAINER_CLASS: run
:END:

** Document It
:PROPERTIES:
:HTML_CONTAINER_CLASS: document
:END:

** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:

** Program It
:PROPERTIES:
:HTML_CONTAINER_CLASS: program
:END:

** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:

** Save It
:PROPERTIES:
:HTML_CONTAINER_CLASS: save
:END:

* Introduction: Matters of Life and Death
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Document It: The Death fight
:PROPERTIES:
:HTML_CONTAINER_CLASS: document
:END:
- You have been challenged to a gun fight on the mean streets of Bourne. 
- There are three combatants - you, James Bond and James Bourne, a local boy.
- Each of you has one bullet.
- The chances of you hitting anything is 1%. You see yourself more of an lover and than a fighter.
- Bond hits his target 85% of the time.
- Bourne hits his target 99%.
*Decision Time*
- You go first...
- Who do you aim for and why?
- What is the best play for you to make? 
- Can you explain it?
** Badge It Silver
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:      
Write up your thoughts on the Gun fight:
- What are your choices?
- What should you do?
** Learn It: The Game of Life 
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
*The scenario:*
- The Game of Life is in short a simulation of a group of cells. At every step in time, often referred to in the game as a tick, cells live or die depending on their surroundings.
- There are four rules which are applied simultaneously to all the cells in the game:
1. Any live cell with fewer than two live neighbours dies, as if caused by under-population.
2. Any live cell with two or three live neighbours lives on to the next generation.
3. Any live cell with more than three live neighbours dies, as if by overcrowding.
4. Any dead cell with exactly three live neighbours becomes a live cell, as if by reproduction.
*Video here?*

We are going to tackle this in 4 parts:

- Stage 1 - Creating a blank pygame screen.
- Stage 2 - Creating a blank grid on the pygame screen.
- Stage 3 - Creating random coloured cells on the screen.
- Stage 4 - Working Game of Life.

** Code It: Stage One
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- Lots of details here.



** Code It: Stage Two
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- Lots of details here.



** Code It: Stage Three
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- Lots of details here.


** Code It: Stage Four
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- Lots of details here.



** Badge It: Gold / Platinum
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:

- Code your game. Add a screenshot of your code and the output.
-Explain what is happening:

The quality of your written answer will determine whether you are awarded Gold or Platinum.
