pages/6_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The End is Nigh&#x2026;</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">The End is Nigh&#x2026;</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/9-CS-gameTheory">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li> 
      <li><a href="5_Lesson.html">Week5</a></li> 
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="assessment.html">Assessment</a></li>
    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1">Introduction: Matters of Life and Death</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 document">
<h3 id="sec-1-1">Document It: The Death fight</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>You have been challenged to a gun fight on the mean streets of Bourne. 
</li>
<li>There are three combatants - you, James Bond and James Bourne, a local boy.
</li>
<li>Each of you has one bullet.
</li>
<li>The chances of you hitting anything is 1%. You see yourself more of an lover and than a fighter.
</li>
<li>Bond hits his target 85% of the time.
</li>
<li>Bourne hits his target 99%.
</li>
</ul>
<p>
<b>Decision Time</b>
</p>
<ul class="org-ul">
<li>You go first&#x2026;
</li>
<li>Who do you aim for and why?
</li>
<li>What is the best play for you to make? 
</li>
<li>Can you explain it?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 badge">
<h3 id="sec-1-2">Badge It Silver</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Write up your thoughts on the Gun fight:
</p>
<ul class="org-ul">
<li>What are your choices?
</li>
<li>What should you do?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 learn">
<h3 id="sec-1-3">Learn It: The Game of Life</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>The scenario:</b>
</p>
<ul class="org-ul">
<li>The Game of Life is in short a simulation of a group of cells. At every step in time, often referred to in the game as a tick, cells live or die depending on their surroundings.
</li>
<li>There are four rules which are applied simultaneously to all the cells in the game:
</li>
<li>Any live cell with fewer than two live neighbours dies, as if caused by under-population.
</li>
<li>Any live cell with two or three live neighbours lives on to the next generation.
</li>
<li>Any live cell with more than three live neighbours dies, as if by overcrowding.
</li>
<li>Any dead cell with exactly three live neighbours becomes a live cell, as if by reproduction.
</li>
</ul>
<p>
<b>Video here?</b>
</p>

<p>
We are going to tackle this in 4 parts:
</p>

<ul class="org-ul">
<li>Stage 1 - Creating a blank pygame screen.
</li>
<li>Stage 2 - Creating a blank grid on the pygame screen.
</li>
<li>Stage 3 - Creating random coloured cells on the screen.
</li>
<li>Stage 4 - Working Game of Life.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3 code">
<h3 id="sec-1-4">Code It: Stage One</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Lots of details here.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-5" class="outline-3 code">
<h3 id="sec-1-5">Code It: Stage Two</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Lots of details here.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-6" class="outline-3 code">
<h3 id="sec-1-6">Code It: Stage Three</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Lots of details here.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-7" class="outline-3 code">
<h3 id="sec-1-7">Code It: Stage Four</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Lots of details here.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-8" class="outline-3 badge">
<h3 id="sec-1-8">Badge It: Gold / Platinum</h3>
<div class="outline-text-3" id="text-1-8">

<ul class="org-ul">
<li>Code your game. Add a screenshot of your code and the output.
</li>
</ul>
<p>
-Explain what is happening:
</p>

<p>
The quality of your written answer will determine whether you are awarded Gold or Platinum.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
